Tekla Open API Reference for Tekla Structures 2025
ReinforcementSingleAttributes Methods
The ReinforcementBase.ReinforcementSingleAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ReinforcementBase.ReinforcementBaseAttributes.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
Top
See Also
Reference
ReinforcementBase.ReinforcementSingleAttributes Class
Tekla.Structures.Drawing Namespace